In [2]:
!pip install pandas
import pandas as pd

Requirement already satisfied: pandas in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (2.2.0)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\roaming\python\python312\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.4)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.4)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 23.3.1 -> 23.3.2
[notice] To update, run: python.exe -m pip install --upgrade pip
C:\Users\User\AppData\Local\Temp\ipykernel_12840\3144141588.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [51]:
import pandas as pd
emp=[[1,"AaAA"],[2,"BBB"],[3,"CCC"],[4,"DDDD"],[5,"EEEE"]]
df = pd.DataFrame(emp)  #if columns value was not given, it automatically take it as index
df

   0     1
0  1  AaAA
1  2   BBB
2  3   CCC
3  4  DDDD
4  5  EEEE

In [52]:
df = pd.DataFrame(emp,columns=["Emp_id","Name"])  #if columns value  given, it take it as given value
df

   Emp_id  Name
0       1  AaAA
1       2   BBB
2       3   CCC
3       4  DDDD
4       5  EEEE

In [15]:
import pandas as pd
#if we are creating multiple rows and columns then we have to create nested list
emp=[[1,"AaAA"],[2,"BBB"],[3,"CCC"],[4,"DDDD"],[5,"EEEE"]]
column=["Emp_Id","Name"]
df = pd.DataFrame.from_records(emp,columns=column)
df

   Emp_Id  Name
0       1  AaAA
1       2   BBB
2       3   CCC
3       4  DDDD
4       5  EEEE

In [50]:
students=[[1,"AAAA",23],[2,"BBBB",24],[3,"CCCC",25],[4,"DDDD",26],[5,"EEEE",27]]
columns=["Stud_id","Name","Age"]
df_stud=pd.DataFrame(students,columns=columns,index=["First","Second","Third","Four","Five"])
df_stud.astype({"Name":'category',"Age":'int64'})
df_stud.Name.astype('category')
df_stud.Age.astype('int')
type(df_stud["Age"][0])
df_stud.Age[0]#two ways to access data in dataFrame
#df['Age'] = pd.to_numeric(df['Age'], errors='coerce')  --> Another method for converting particular row 
df_stud.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, First to Five
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Stud_id  5 non-null      int64
 1   Name     5 non-null      object
 2   Age      5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 160.0+ bytes

C:\Users\User\AppData\Local\Temp\ipykernel_12840\113999538.py:7: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  type(df_stud["Age"][0])
C:\Users\User\AppData\Local\Temp\ipykernel_12840\113999538.py:8: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df_stud.Age[0]#two ways to access data in dataFrame

In [ ]:
df_stud.transpose() #it changes row_name into col_name and col_name into row_name

In [36]:
#Keys=Rows , Values=Columns
#if We are passing multiple values for single key  ,then we have to use "List"
data = {'Category':['Array', 'Stack', 'Queue'],
        'Marks':[20, 21, 19]} 
data

{'Category': ['Array', 'Stack', 'Queue'], 'Marks': [20, 21, 19]}

In [21]:
df=pd.DataFrame(data,index=["Cat1","Cat2","Cat3"])
df

     Category  Marks
Cat1    Array     20
Cat2    Stack     21
Cat3    Queue     19

In [63]:
# data in the form of list of tuples
data = [('Peter', 18, 7,10),
        ('Riff', 15, 6,10),
        ('John', 17, 8,11),
        ('Michel', 18, 7,11),
        ('Sheli', 17, 5) ]    # no value given in 4 column so it take it as NaN
 
# create DataFrame using data
df = pd.DataFrame(data, columns =['Name', 'Age', 'Score','Mark'],index=["Cat1","Cat2","Cat3","Cat4","Cat5"])
#df = pd.DataFrame.from_records(data, columns =['Team', 'Age', 'Score'])
df

        Name  Age  Score  Mark
Cat1   Peter   18      7  10.0
Cat2    Riff   15      6  10.0
Cat3    John   17      8  11.0
Cat4  Michel   18      7  11.0
Cat5   Sheli   17      5   NaN

In [94]:
Stud_details = {
        "Name": ["Paras Jain","Chunky Pandey"],
        "Maths": [90,99] ,
        "physics":[88,99],
        "Grade": ["a","b"]
    }
index_ = [pd.Period('02-2018'), pd.Period('04-2018')]
df1=pd.DataFrame(Stud_details,index=index_)

df1=pd.DataFrame(Stud_details)
print(df1)

            Name  Maths  physics Grade
0     Paras Jain     90       88     a
1  Chunky Pandey     99       99     b

In [ ]:
df = df.pivot_table(index='Name', columns=['Grade'],
                    values=['Exam']).reset_index()
# Defining columns
df.columns = ['Name', 'Maths', 'Physics', 'Chemistry']
 
# print dataframe
print(df)

In [90]:
stude={"Maths":[99,100,20],"Name":["AAAA","BBB","CCCC"],"Physics":[99,100,20]}

df=pd.DataFrame(stude)
df
df.replace("object","text")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Maths    3 non-null      int64
 1   Name     3 non-null      object
 2   Physics  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [93]:
# Creating two lists
author = ['Jitender', 'Purnima',
          'Arpit', 'Jyoti']
article = [210, 211, 114, 178]
 
# Creating two Series by passing lists
auth_series = pd.Series(author)
article_series = pd.Series(article)
 
# Creating a dictionary by passing Series objects as values
frame = {'Author': auth_series,
         'Article': article_series}
 
# Creating DataFrame by passing Dictionary
result = pd.DataFrame(frame)
result["Age"]=[1,2,3,4]
# Printing elements of Dataframe
result

     Author  Article  Age
0  Jitender      210    1
1   Purnima      211    2
2     Arpit      114    3
3     Jyoti      178    4

In [16]:
import pandas as pd
 
# Creating two lists
author = ['Jitender', 'Purnima',
          'Arpit', 'Jyoti']
article = [210, 211, 114, 178]
 
# Creating two Series by passing lists
auth_series = pd.Series(author)
article_series = pd.Series(article)
 
# Creating a dictionary by passing Series objects as values
frame = {'Author': auth_series,
         'Article': article_series}
 
# Creating DataFrame by passing Dictionary
result = pd.DataFrame(frame)
result 
# Printing elements of Dataframe
for i in result.itertuples():
    print(getattr(i,'Author'),getattr(i,'Article'))
result

Jitender 210
Purnima 211
Arpit 114
Jyoti 178

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178

In [17]:
print(result['Author'][0],result["Article"][1])
print(result.loc[1,'Author'],result.loc[2,'Article'])
print(result.iloc[0,1],result.iloc[2,1])

Jitender 211
Purnima 114
210 114